jeremybobbin/esp32-s3/soc/phy.c
#include <errno.h>
#include <stddef.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <sys/lock.h>

#include "freertos/FreeRTOS.h"
#include "freertos/portmacro.h"
#include "soc/phy.h"
#include "soc/gpio.h"
#include "soc/peripherals.h"
#include "soc/trace.h"
#include "bluetooth/bluetooth.h"

#define DR_REG_SYSCON_BASE                      0x60026000
#define SYSCON_WIFI_RST_EN_REG          (DR_REG_SYSCON_BASE + 0x18)
#define LIMIT(val, low, high) ((val < low) ? low : (val > high) ? high : val)

static const esp_phy_init_data_t phy_init_data = { {
	0x00,
	0x00,
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x50),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x50),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x50),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x4c),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x4c),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x48),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x4c),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x48),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x48),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x44),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x4a),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x46),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x46),
	LIMIT(CONFIG_ESP_PHY_MAX_TX_POWER * 4, 0, 0x42),
	0x00,
	0x00,
	0x00,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0xff,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0,
	0x74
} };



static const char *TAG = "phy_init";

static _lock_t s_phy_access_lock;

static  struct {
	int     count;  /* power on count of wifi and bt power domain */
	_lock_t lock;
} s_wifi_bt_pd_controller = { .count = 0 };

/* Indicate PHY is calibrated or not */
static bool s_is_phy_calibrated = false;

static bool s_is_phy_reg_stored = false;

/* Reference count of enabling PHY */
static uint8_t s_phy_access_ref = 0;

#if CONFIG_MAC_BB_PD
/* Reference of powering down MAC and BB */
static bool s_mac_bb_pu = true;
#endif

#if CONFIG_IDF_TARGET_ESP32
/* time stamp updated when the PHY/RF is turned on */
static int64_t s_phy_rf_en_ts = 0;
#endif

/* PHY spinlock for libphy.a */
static portMUX_TYPE s_phy_int_mux = portMUX_INITIALIZER_UNLOCKED;

/* Memory to store PHY digital registers */
static uint32_t* s_phy_digital_regs_mem = NULL;
static uint8_t s_phy_modem_init_ref = 0;

#if CONFIG_MAC_BB_PD
uint32_t* s_mac_bb_pd_mem = NULL;
/* Reference count of MAC BB backup memory */
static uint8_t s_macbb_backup_mem_ref = 0;
#endif

#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
extern uint8_t multi_phy_init_data_bin_start[] asm("_binary_phy_multiple_init_data_bin_start");
extern uint8_t multi_phy_init_data_bin_end[]   asm("_binary_phy_multiple_init_data_bin_end");
#endif
/* The following static variables are only used by Wi-Fi tasks, so they can be handled without lock */
static phy_init_data_type_t s_phy_init_data_type = 0;

static phy_init_data_type_t s_current_apply_phy_init_data = 0;

static char s_phy_current_country[PHY_COUNTRY_CODE_LEN] = {0};

/* Whether it is a new bin */
static bool s_multiple_phy_init_data_bin = false;

/* PHY init data type array */
static char* s_phy_type[ESP_PHY_INIT_DATA_TYPE_NUMBER] = {"DEFAULT", "SRRC", "FCC", "CE", "NCC", "KCC", "MIC", "IC",
	"ACMA", "ANATEL", "ISED", "WPC", "OFCA", "IFETEL", "RCM"};

/* Country and PHY init data type map */
static phy_country_to_bin_type_t s_country_code_map_type_table[] = {
	{"AT",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"AU",  ESP_PHY_INIT_DATA_TYPE_ACMA},
	{"BE",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"BG",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"BR",  ESP_PHY_INIT_DATA_TYPE_ANATEL},
	{"CA",  ESP_PHY_INIT_DATA_TYPE_ISED},
	{"CH",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"CN",  ESP_PHY_INIT_DATA_TYPE_SRRC},
	{"CY",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"CZ",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"DE",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"DK",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"EE",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"ES",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"FI",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"FR",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"GB",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"GR",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"HK",  ESP_PHY_INIT_DATA_TYPE_OFCA},
	{"HR",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"HU",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"IE",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"IN",  ESP_PHY_INIT_DATA_TYPE_WPC},
	{"IS",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"IT",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"JP",  ESP_PHY_INIT_DATA_TYPE_MIC},
	{"KR",  ESP_PHY_INIT_DATA_TYPE_KCC},
	{"LI",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"LT",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"LU",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"LV",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"MT",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"MX",  ESP_PHY_INIT_DATA_TYPE_IFETEL},
	{"NL",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"NO",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"NZ",  ESP_PHY_INIT_DATA_TYPE_RCM},
	{"PL",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"PT",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"RO",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"SE",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"SI",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"SK",  ESP_PHY_INIT_DATA_TYPE_CE},
	{"TW",  ESP_PHY_INIT_DATA_TYPE_NCC},
	{"US",  ESP_PHY_INIT_DATA_TYPE_FCC},
};
#endif
uint32_t phy_enter_critical(void)
{
	if (xPortInIsrContext()) {
		portENTER_CRITICAL_ISR(&s_phy_int_mux);

	} else {
		portENTER_CRITICAL(&s_phy_int_mux);
	}
	// Interrupt level will be stored in current tcb, so always return zero.
	return 0;
}

void phy_exit_critical(uint32_t level)
{
	// Param level don't need any more, ignore it.
	if (xPortInIsrContext()) {
		portEXIT_CRITICAL_ISR(&s_phy_int_mux);
	} else {
		portEXIT_CRITICAL(&s_phy_int_mux);
	}
}

#if CONFIG_IDF_TARGET_ESP32
int64_t esp_phy_rf_get_on_ts(void)
{
	return s_phy_rf_en_ts;
}

