jeremybobbin/esp32-s3/soc/phy.c
void phy_update_wifi_mac_time(bool en_clock_stopped, int64_t now)
{
	static uint32_t s_common_clock_disable_time = 0;

	if (en_clock_stopped) {
		s_common_clock_disable_time = (uint32_t)now;
	} else {
		if (s_common_clock_disable_time) {
			uint32_t diff = (uint64_t)now - s_common_clock_disable_time;

			if (s_wifi_mac_time_update_cb) {
				s_wifi_mac_time_update_cb(diff);
			}
			s_common_clock_disable_time = 0;
		}
	}
}
#endif

void esp_phy_common_clock_enable(void)
{
	wifi_bt_common_module_enable();
}

void esp_phy_common_clock_disable(void)
{
	wifi_bt_common_module_disable();
}

void phy_digital_regs_store(void)
{
	if (s_phy_digital_regs_mem != NULL) {
		phy_dig_reg_backup(true, s_phy_digital_regs_mem);
		s_is_phy_reg_stored = true;
	}
}

void phy_digital_regs_load(void)
{
	if (s_is_phy_reg_stored && s_phy_digital_regs_mem != NULL) {
		phy_dig_reg_backup(false, s_phy_digital_regs_mem);
	}
}

void esp_phy_enable(void)
{
	_lock_acquire(&s_phy_access_lock);

	if (s_phy_access_ref == 0) {
#if CONFIG_IDF_TARGET_ESP32
		// Update time stamp
		s_phy_rf_en_ts = esp_timer_get_time();
		// Update WiFi MAC time before WiFi/BT common clock is enabled
		phy_update_wifi_mac_time(false, s_phy_rf_en_ts);
#endif
		esp_phy_common_clock_enable();

		if (s_is_phy_calibrated == false) {
			esp_phy_load_cal_and_init();
			s_is_phy_calibrated = true;
		}
		else {
			phy_wakeup_init();
			phy_digital_regs_load();
		}

#if CONFIG_IDF_TARGET_ESP32
		coex_bt_high_prio();
#endif
	}
	s_phy_access_ref++;

	_lock_release(&s_phy_access_lock);
}

void esp_phy_disable(void)
{
	_lock_acquire(&s_phy_access_lock);

	s_phy_access_ref--;
	if (s_phy_access_ref == 0) {
		phy_digital_regs_store();
		// Disable PHY and RF.
		phy_close_rf();
#if !CONFIG_IDF_TARGET_ESP32
		// Disable PHY temperature sensor
		phy_xpd_tsens();
#endif
#if CONFIG_IDF_TARGET_ESP32
		// Update WiFi MAC time before disalbe WiFi/BT common peripheral clock
		phy_update_wifi_mac_time(true, esp_timer_get_time());
#endif
		// Disable WiFi/BT common peripheral clock. Do not disable clock for hardware RNG
		esp_phy_common_clock_disable();
	}

	_lock_release(&s_phy_access_lock);
}

void esp_wifi_bt_power_domain_on(void)
{
	_lock_acquire(&s_wifi_bt_pd_controller.lock);
	if (s_wifi_bt_pd_controller.count++ == 0) {
		CLEAR_PERI_REG_MASK(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_WIFI_FORCE_PD);
#if !CONFIG_IDF_TARGET_ESP32
		SET_PERI_REG_MASK(SYSCON_WIFI_RST_EN_REG, MODEM_RESET_FIELD_WHEN_PU);
		CLEAR_PERI_REG_MASK(SYSCON_WIFI_RST_EN_REG, MODEM_RESET_FIELD_WHEN_PU);
#endif
		CLEAR_PERI_REG_MASK(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_WIFI_FORCE_ISO);
	}
	_lock_release(&s_wifi_bt_pd_controller.lock);
}

void esp_wifi_bt_power_domain_off(void)
{
	_lock_acquire(&s_wifi_bt_pd_controller.lock);
	if (--s_wifi_bt_pd_controller.count == 0) {
		SET_PERI_REG_MASK(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_WIFI_FORCE_ISO);
		SET_PERI_REG_MASK(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_WIFI_FORCE_PD);
	}
	_lock_release(&s_wifi_bt_pd_controller.lock);
}

void esp_phy_modem_init(void)
{
	_lock_acquire(&s_phy_access_lock);

	s_phy_modem_init_ref++;
	if (s_phy_digital_regs_mem == NULL) {
		s_phy_digital_regs_mem = (uint32_t *)heap_caps_malloc(SOC_PHY_DIG_REGS_MEM_SIZE, MALLOC_CAP_DMA|MALLOC_CAP_INTERNAL);
	}

	_lock_release(&s_phy_access_lock);

}

void esp_phy_modem_deinit(void)
{
	_lock_acquire(&s_phy_access_lock);

	s_phy_modem_init_ref--;
	if (s_phy_modem_init_ref == 0) {
		s_is_phy_reg_stored = false;
		free(s_phy_digital_regs_mem);
		s_phy_digital_regs_mem = NULL;
		/* Fix the issue caused by the power domain off.
		* This issue is only on ESP32C3.
		*/
#if CONFIG_IDF_TARGET_ESP32C3
		phy_init_flag();
#endif
	}

	_lock_release(&s_phy_access_lock);
}

#if CONFIG_MAC_BB_PD
void esp_mac_bb_pd_mem_init(void)
{
	_lock_acquire(&s_phy_access_lock);

	s_macbb_backup_mem_ref++;
	if (s_mac_bb_pd_mem == NULL) {
		s_mac_bb_pd_mem = (uint32_t *)heap_caps_malloc(SOC_MAC_BB_PD_MEM_SIZE, MALLOC_CAP_DMA|MALLOC_CAP_INTERNAL);
	}

	_lock_release(&s_phy_access_lock);
}

void esp_mac_bb_pd_mem_deinit(void)
{
	_lock_acquire(&s_phy_access_lock);

	s_macbb_backup_mem_ref--;
	if (s_macbb_backup_mem_ref == 0) {
		free(s_mac_bb_pd_mem);
		s_mac_bb_pd_mem = NULL;
	}

	_lock_release(&s_phy_access_lock);
}

void esp_mac_bb_power_up(void)
{
	if (s_mac_bb_pd_mem == NULL) {
		return;
	}
	esp_wifi_bt_power_domain_on();
	if (!s_mac_bb_pu) {
		esp_phy_common_clock_enable();
		phy_freq_mem_backup(false, s_mac_bb_pd_mem);
		esp_phy_common_clock_disable();
		s_mac_bb_pu = true;
	}
}

void esp_mac_bb_power_down(void)
{
	if (s_mac_bb_pd_mem == NULL) {
		return;
	}
	if (s_mac_bb_pu) {
		esp_phy_common_clock_enable();
		phy_freq_mem_backup(true, s_mac_bb_pd_mem);
		esp_phy_common_clock_disable();
		s_mac_bb_pu = false;
	}
	esp_wifi_bt_power_domain_off();
}
#endif

// PHY init data handling functions
#if CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION
#include "esp_partition.h"

const esp_phy_init_data_t* esp_phy_get_init_data(void)
{
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
	size_t init_data_store_length = sizeof(phy_init_magic_pre) +
			sizeof(esp_phy_init_data_t) + sizeof(phy_init_magic_post);
	uint8_t* init_data_store = (uint8_t*) malloc(init_data_store_length);
	if (init_data_store == NULL) {
		return NULL;
	}
	memcpy(init_data_store, multi_phy_init_data_bin_start, init_data_store_length);
#else
	const esp_partition_t* partition = esp_partition_find_first(
			ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_PHY, NULL);
	if (partition == NULL) {
		return NULL;
	}
	size_t init_data_store_length = sizeof(phy_init_magic_pre) +
			sizeof(esp_phy_init_data_t) + sizeof(phy_init_magic_post);
	uint8_t* init_data_store = (uint8_t*) malloc(init_data_store_length);
	if (init_data_store == NULL) {
		return NULL;
	}
	// read phy data from flash
	int err = esp_partition_read(partition, 0, init_data_store, init_data_store_length);
	if (err != 0) {
		free(init_data_store);
		return NULL;
	}
#endif
	// verify data
	if (memcmp(init_data_store, PHY_INIT_MAGIC, sizeof(phy_init_magic_pre)) != 0 ||
		memcmp(init_data_store + init_data_store_length - sizeof(phy_init_magic_post),
				PHY_INIT_MAGIC, sizeof(phy_init_magic_post)) != 0) {
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
		free(init_data_store);
		return NULL;
#else
#ifndef CONFIG_ESP_PHY_DEFAULT_INIT_IF_INVALID
		free(init_data_store);
		return NULL;
#else

		memcpy(init_data_store,
			   PHY_INIT_MAGIC, sizeof(phy_init_magic_pre));
		memcpy(init_data_store + sizeof(phy_init_magic_pre),
			   &phy_init_data, sizeof(phy_init_data));
		memcpy(init_data_store + sizeof(phy_init_magic_pre) + sizeof(phy_init_data),
			   PHY_INIT_MAGIC, sizeof(phy_init_magic_post));

		assert(memcmp(init_data_store, PHY_INIT_MAGIC, sizeof(phy_init_magic_pre)) == 0);
		assert(memcmp(init_data_store + init_data_store_length - sizeof(phy_init_magic_post),
					  PHY_INIT_MAGIC, sizeof(phy_init_magic_post)) == 0);

