jeremybobbin/esp32-s3/soc/phy.c
		// write default data
		err = esp_partition_write(partition, 0, init_data_store, init_data_store_length);
		if (err != 0) {
			free(init_data_store);
			return NULL;
		}
#endif // CONFIG_ESP_PHY_DEFAULT_INIT_IF_INVALID
#endif // CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
	}
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN
	if ((*(init_data_store + (sizeof(phy_init_magic_pre) + PHY_SUPPORT_MULTIPLE_BIN_OFFSET)))) {
		s_multiple_phy_init_data_bin = true;
	}
#endif
	return (const esp_phy_init_data_t*) (init_data_store + sizeof(phy_init_magic_pre));
}

void esp_phy_release_init_data(const esp_phy_init_data_t* init_data)
{
	free((uint8_t*) init_data - sizeof(phy_init_magic_pre));
}

#else // CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION

// phy_init_data.h will declare static 'phy_init_data' variable initialized with default init data

const esp_phy_init_data_t* esp_phy_get_init_data(void)
{
	return &phy_init_data;
}

void esp_phy_release_init_data(const esp_phy_init_data_t* init_data)
{
	// no-op
}
#endif // CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION


// PHY calibration data handling functions
static const char* PHY_NAMESPACE = "phy";
static const char* PHY_CAL_VERSION_KEY = "cal_version";
static const char* PHY_CAL_MAC_KEY = "cal_mac";
static const char* PHY_CAL_DATA_KEY = "cal_data";

int load_cal_data_from_nvs_handle(nvs_handle_t handle, esp_phy_calibration_data_t* out_cal_data) {
	int err;
	uint32_t cal_data_version;

	err = nvs_get_u32(handle, PHY_CAL_VERSION_KEY, &cal_data_version);
	if (err != 0) {
		return err;
	}
	uint32_t cal_format_version = phy_get_rf_cal_version() & (~(1<<(16)));
	if (cal_data_version != cal_format_version) {
		return EPERM;
	}
	uint8_t cal_data_mac[6];
	size_t length = sizeof(cal_data_mac);
	err = nvs_get_blob(handle, PHY_CAL_MAC_KEY, cal_data_mac, &length);
	if (err != 0) {
		return err;
	}
	if (length != sizeof(cal_data_mac)) {
		return EINVAL;
	}
	uint8_t sta_mac[6];
	esp_efuse_mac_get_default(sta_mac);
	if (memcmp(sta_mac, cal_data_mac, sizeof(sta_mac)) != 0) {
		return EPERM;
	}
	length = sizeof(*out_cal_data);
	err = nvs_get_blob(handle, PHY_CAL_DATA_KEY, out_cal_data, &length);
	if (err != 0) {
		return err;
	}
	if (length != sizeof(*out_cal_data)) {
		return EINVAL;
	}
	return 0;
}

int store_cal_data_to_nvs_handle(nvs_handle_t handle, const esp_phy_calibration_data_t* cal_data) {
	int err;

	err = nvs_set_blob(handle, PHY_CAL_DATA_KEY, cal_data, sizeof(*cal_data));
	if (err != 0) {
		return err;
	}

	uint8_t sta_mac[6];
	esp_efuse_mac_get_default(sta_mac);
	err = nvs_set_blob(handle, PHY_CAL_MAC_KEY, sta_mac, sizeof(sta_mac));
	if (err != 0) {
		return err;
	}

	uint32_t cal_format_version = phy_get_rf_cal_version() & (~(1<<(16)));
	err = nvs_set_u32(handle, PHY_CAL_VERSION_KEY, cal_format_version);
	if (err != 0) {
		return err;
	}

	err = nvs_commit(handle);
	if (err != 0) {
	}

	return err;
}

int esp_phy_load_cal_data_from_nvs(esp_phy_calibration_data_t* out_cal_data) {
	nvs_handle_t handle;
	int err = nvs_open(PHY_NAMESPACE, NVS_READONLY, &handle);
	if (err == ESP_ERR_NVS_NOT_INITIALIZED) {
		return err;
	} else if (err != 0) {
		return err;
	}
	err = load_cal_data_from_nvs_handle(handle, out_cal_data);
	nvs_close(handle);
	return err;
}

int esp_phy_store_cal_data_to_nvs(const esp_phy_calibration_data_t* cal_data)
{
	nvs_handle_t handle;
	int err = nvs_open(PHY_NAMESPACE, NVS_READWRITE, &handle);
	if (err != 0) {
		return err;
	}
	else {
		err = store_cal_data_to_nvs_handle(handle, cal_data);
		nvs_close(handle);
		return err;
	}
}

int esp_phy_erase_cal_data_in_nvs(void)
{
	nvs_handle_t handle;
	int err = nvs_open(PHY_NAMESPACE, NVS_READWRITE, &handle);
	if (err != 0) {
		return err;
	}
	else {
		err = nvs_erase_all(handle);
		if (err != 0) {
		}
		else {
			err = nvs_commit(handle);
			if (err != 0) {
			}
		}
	}
	nvs_close(handle);
	return err;
}


#if CONFIG_ESP_PHY_REDUCE_TX_POWER
static void __attribute((unused)) esp_phy_reduce_tx_power(esp_phy_init_data_t* init_data)
{
	uint8_t i;

	for(i = 0; i < PHY_TX_POWER_NUM; i++) {
		// LOWEST_PHY_TX_POWER is the lowest tx power
		init_data->params[PHY_TX_POWER_OFFSET+i] = PHY_TX_POWER_LOWEST;
	}
}
#endif

void esp_phy_load_cal_and_init(void)
{
	char * phy_version = get_phy_version_str();

#if CONFIG_IDF_TARGET_ESP32S2
	phy_eco_version_sel(efuse_hal_get_major_chip_version());
#endif
	esp_phy_calibration_data_t* cal_data =
			(esp_phy_calibration_data_t*) calloc(sizeof(esp_phy_calibration_data_t), 1);
	if (cal_data == NULL) {
		abort();
	}

#if CONFIG_ESP_PHY_REDUCE_TX_POWER
	const esp_phy_init_data_t* phy_init_data = esp_phy_get_init_data();
	if (phy_init_data == NULL) {
		abort();
	}

	esp_phy_init_data_t* init_data = (esp_phy_init_data_t*) malloc(sizeof(esp_phy_init_data_t));
	if (init_data == NULL) {
		abort();
	}

	memcpy(init_data, phy_init_data, sizeof(esp_phy_init_data_t));
	if (esp_reset_reason() == ESP_RST_BROWNOUT) {
		esp_phy_reduce_tx_power(init_data);
	}
#else
	const esp_phy_init_data_t* init_data = esp_phy_get_init_data();
	if (init_data == NULL) {
		abort();
	}
#endif

#if CONFIG_ESP_PHY_ENABLE_USB
	phy_bbpll_en_usb(true);
#endif

#ifdef CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE
	esp_phy_calibration_mode_t calibration_mode = PHY_RF_CAL_PARTIAL;
	uint8_t sta_mac[6];
	if (esp_rom_get_reset_reason(0) == RESET_REASON_CORE_DEEP_SLEEP) {
		calibration_mode = PHY_RF_CAL_NONE;
	}
	int err = esp_phy_load_cal_data_from_nvs(cal_data);
	if (err != 0) {
		calibration_mode = PHY_RF_CAL_FULL;
	}

	esp_efuse_mac_get_default(sta_mac);
	memcpy(cal_data->mac, sta_mac, 6);
	int ret = register_chipv7_phy(init_data, cal_data, calibration_mode);
	if (ret == ESP_CAL_DATA_CHECK_FAIL) {
	}

	if ((calibration_mode != PHY_RF_CAL_NONE && err != 0) ||
			(calibration_mode != PHY_RF_CAL_FULL && ret == ESP_CAL_DATA_CHECK_FAIL)) {
		err = esp_phy_store_cal_data_to_nvs(cal_data);
	} else {
		err = 0;
	}
#else
	register_chipv7_phy(init_data, cal_data, PHY_RF_CAL_FULL);
#endif

#if CONFIG_ESP_PHY_REDUCE_TX_POWER
	esp_phy_release_init_data(phy_init_data);
	free(init_data);
#else
	esp_phy_release_init_data(init_data);
#endif

	free(cal_data); // PHY maintains a copy of calibration data, so we can free this
}

#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN
static int phy_crc_check_init_data(uint8_t* init_data, const uint8_t* checksum, size_t init_data_length)
{
	uint32_t crc_data = 0;
	crc_data = esp_rom_crc32_le(crc_data, init_data, init_data_length);
	uint32_t crc_size_conversion = htonl(crc_data);

	if (crc_size_conversion != *(uint32_t*)(checksum)) {
		return EPERM;
	}
	return 0;
}

static uint8_t phy_find_bin_type_according_country(const char* country)
{
	uint32_t i = 0;
	uint8_t phy_init_data_type = 0;

	for (i = 0; i < sizeof(s_country_code_map_type_table)/sizeof(phy_country_to_bin_type_t); i++)
	{
		if (!memcmp(country, s_country_code_map_type_table[i].cc, sizeof(s_phy_current_country))) {
			phy_init_data_type = s_country_code_map_type_table[i].type;
			break;
		}
	}

	if (i == sizeof(s_country_code_map_type_table)/sizeof(phy_country_to_bin_type_t)) {
		phy_init_data_type = ESP_PHY_INIT_DATA_TYPE_DEFAULT;
	}

	return phy_init_data_type;
}

static int phy_find_bin_data_according_type(uint8_t* out_init_data_store,
		const phy_control_info_data_t* init_data_control_info,
		const uint8_t* init_data_multiple,
		phy_init_data_type_t init_data_type)
{
	  int i = 0;
	  for (i = 0; i < init_data_control_info->number; i++) {
		  if (init_data_type == *(init_data_multiple + (i * sizeof(esp_phy_init_data_t)) + PHY_INIT_DATA_TYPE_OFFSET)) {
			  memcpy(out_init_data_store + sizeof(phy_init_magic_pre),
					  init_data_multiple + (i * sizeof(esp_phy_init_data_t)), sizeof(esp_phy_init_data_t));
			  break;
		  }
	  }

	  if (i == init_data_control_info->number) {
		  return EPERM;
	  }
	  return 0;
}

