jeremybobbin/esp32-s3/soc/phy.c
static int phy_get_multiple_init_data(const esp_partition_t* partition,
		uint8_t* init_data_store,
		size_t init_data_store_length,
		phy_init_data_type_t init_data_type)
{
	phy_control_info_data_t* init_data_control_info = (phy_control_info_data_t*) malloc(sizeof(phy_control_info_data_t));
	if (init_data_control_info == NULL) {
		return EPERM;
	}
	int err = 0;
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
	memcpy(init_data_control_info, multi_phy_init_data_bin_start + init_data_store_length, sizeof(phy_control_info_data_t));
#else
	err = esp_partition_read(partition, init_data_store_length, init_data_control_info, sizeof(phy_control_info_data_t));
	if (err != 0) {
		free(init_data_control_info);
		return EPERM;
	}
#endif
	if ((init_data_control_info->check_algorithm) == PHY_CRC_ALGORITHM) {
		err =  phy_crc_check_init_data(init_data_control_info->multiple_bin_checksum, init_data_control_info->control_info_checksum,
				sizeof(phy_control_info_data_t) - sizeof(init_data_control_info->control_info_checksum));
		if (err != 0) {
			free(init_data_control_info);
			return EPERM;
		}
	} else {
		free(init_data_control_info);
		return EPERM;
	}

	uint8_t* init_data_multiple = (uint8_t*) malloc(sizeof(esp_phy_init_data_t) * init_data_control_info->number);
	if (init_data_multiple == NULL) {
		free(init_data_control_info);
		return EPERM;
	}

#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
	memcpy(init_data_multiple, multi_phy_init_data_bin_start + init_data_store_length + sizeof(phy_control_info_data_t), sizeof(esp_phy_init_data_t) * init_data_control_info->number);
#else
	err = esp_partition_read(partition, init_data_store_length + sizeof(phy_control_info_data_t),
			init_data_multiple, sizeof(esp_phy_init_data_t) * init_data_control_info->number);
	if (err != 0) {
		free(init_data_multiple);
		free(init_data_control_info);
		return EPERM;
	}
#endif
	if ((init_data_control_info->check_algorithm) == PHY_CRC_ALGORITHM) {
		err = phy_crc_check_init_data(init_data_multiple, init_data_control_info->multiple_bin_checksum,
				sizeof(esp_phy_init_data_t) * init_data_control_info->number);
		if (err != 0) {
			free(init_data_multiple);
			free(init_data_control_info);
			return EPERM;
		}
	} else {
		free(init_data_multiple);
		free(init_data_control_info);
		return EPERM;
	}

	err = phy_find_bin_data_according_type(init_data_store, init_data_control_info, init_data_multiple, init_data_type);
	if (err != 0) {
		s_phy_init_data_type = ESP_PHY_INIT_DATA_TYPE_DEFAULT;
	} else {
		s_phy_init_data_type = init_data_type;
	}

	free(init_data_multiple);
	free(init_data_control_info);
	return 0;
}

int esp_phy_update_init_data(phy_init_data_type_t init_data_type)
{
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN_EMBED
	int err = 0;
	const esp_partition_t* partition = NULL;
	size_t init_data_store_length = sizeof(phy_init_magic_pre) +
		sizeof(esp_phy_init_data_t) + sizeof(phy_init_magic_post);
	uint8_t* init_data_store = (uint8_t*) malloc(init_data_store_length);
	if (init_data_store == NULL) {
		return ENOMEM;
	}
	memcpy(init_data_store, multi_phy_init_data_bin_start, init_data_store_length);
#else
	const esp_partition_t* partition = esp_partition_find_first(
		  ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_PHY, NULL);
	if (partition == NULL) {
		return EPERM;
	}
	size_t init_data_store_length = sizeof(phy_init_magic_pre) +
		sizeof(esp_phy_init_data_t) + sizeof(phy_init_magic_post);
	uint8_t* init_data_store = (uint8_t*) malloc(init_data_store_length);
	if (init_data_store == NULL) {
		return ENOMEM;
	}

	int err = esp_partition_read(partition, 0, init_data_store, init_data_store_length);
	if (err != 0) {
		free(init_data_store);
		return EPERM;
	}
#endif
	if (memcmp(init_data_store, PHY_INIT_MAGIC, sizeof(phy_init_magic_pre)) != 0 ||
			memcmp(init_data_store + init_data_store_length - sizeof(phy_init_magic_post),
				PHY_INIT_MAGIC, sizeof(phy_init_magic_post)) != 0) {
		free(init_data_store);
		return EPERM;
	}

	//find init data bin according init data type
	if (init_data_type != ESP_PHY_INIT_DATA_TYPE_DEFAULT) {
		err = phy_get_multiple_init_data(partition, init_data_store, init_data_store_length, init_data_type);
		if (err != 0) {
			free(init_data_store);
#if CONFIG_ESP_PHY_INIT_DATA_ERROR
			abort();
#else
			return EPERM;
#endif
		}
	} else {
		s_phy_init_data_type = ESP_PHY_INIT_DATA_TYPE_DEFAULT;
	}

	if (s_current_apply_phy_init_data != s_phy_init_data_type) {
		err = esp_phy_apply_phy_init_data(init_data_store + sizeof(phy_init_magic_pre));
		if (err != 0) {
			free(init_data_store);
			return EPERM;
		}

				s_phy_type[s_current_apply_phy_init_data], s_phy_type[s_phy_init_data_type]);
		s_current_apply_phy_init_data = s_phy_init_data_type;
	}

	free(init_data_store);
	return 0;
}
#endif

int esp_phy_update_country_info(const char *country)
{
#if CONFIG_ESP_PHY_MULTIPLE_INIT_DATA_BIN
	uint8_t phy_init_data_type_map = 0;

	if (!s_multiple_phy_init_data_bin) {
		return EPERM;
	}

	if (!memcmp(country, s_phy_current_country, sizeof(s_phy_current_country))) {
		return 0;
	}

	memcpy(s_phy_current_country, country, sizeof(s_phy_current_country));

	phy_init_data_type_map = phy_find_bin_type_according_country(country);
	if (phy_init_data_type_map == s_phy_init_data_type) {
		return 0;
	}

	int err =  esp_phy_update_init_data(phy_init_data_type_map);
	if (err != 0) {
		return err;
	}
#endif
	return 0;
}

void esp_wifi_power_domain_on(void) __attribute__((alias("esp_wifi_bt_power_domain_on")));
void esp_wifi_power_domain_off(void) __attribute__((alias("esp_wifi_bt_power_domain_off")));
